---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeletedWarn
source: html/a6ff72a4-6812-4a93-4564-3cef069d0a9a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.LockedDeletedWarn Property

Pinned objects deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId LockedDeletedWarn { get; }
```